## Import 'pandas'

In [1]:
import pandas as pd

## Create a DataFrame
 - first, second raw

In [14]:
first_raw ={
    'id' : ['1','2','3','4','5'],
    'a_name' : ['a','b','c','d','e'],
    'b_name' : ['a1','b1','c1','d1','e1']
}

second_raw = {
    'id' : ['4','5','6','7','8'],
    'a_name' : ['A','B','C','D','E'],
    'b_name' : ['A1','B1','C1','D1','E1']
}
third_raw = {
    'id' : ['1','2','3','4','5','7','8','9','10','11'],
    'test_id' : [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
}

## DataFrame columns name setting

In [15]:
df_a = pd.DataFrame(first_raw, columns=['id','a_name','b_name'])
df_b = pd.DataFrame(second_raw, columns=['id','a_name','b_name'])
df_c = pd.DataFrame(third_raw, columns=['id','test_id'])

In [4]:
df_a

  id a_name b_name
0  1      a     a1
1  2      b     b1
2  3      c     c1
3  4      d     d1
4  5      e     e1

In [16]:
df_b

  id a_name b_name
0  4      A     A1
1  5      B     B1
2  6      C     C1
3  7      D     D1
4  8      E     E1

In [17]:
df_c

   id  test_id
0   1       51
1   2       15
2   3       15
3   4       61
4   5       16
5   7       14
6   8       15
7   9        1
8  10       61
9  11       16

## Join the dataframe along rows

In [9]:
join_df = pd.concat([df_a, df_b])
join_df

  id a_name b_name
0  1      a     a1
1  2      b     b1
2  3      c     c1
3  4      d     d1
4  5      e     e1
0  4      A     A1
1  5      B     B1
2  6      C     C1
3  7      D     D1
4  8      E     E1

## Join the dataframe along columns

In [8]:
pd.concat([df_a, df_b], axis=1)

  id a_name b_name id a_name b_name
0  1      a     a1  4      A     A1
1  2      b     b1  5      B     B1
2  3      c     c1  6      C     C1
3  4      d     d1  7      D     D1
4  5      e     e1  8      E     E1

## Merge the dataframe along the 'id'(key value)
두 DataFrame에서 이름이 같은 열은 모두 키가 된다. 'on'을 사용해서 'key' 지정 가능

In [18]:
pd.merge(join_df, df_c, on='id')

  id a_name b_name  test_id
0  1      a     a1       51
1  2      b     b1       15
2  3      c     c1       15
3  4      d     d1       61
4  4      A     A1       61
5  5      e     e1       16
6  5      B     B1       16
7  7      D     D1       14
8  8      E     E1       15

## Merge two dataframes with both the left and right dataframes using the 'id' key
만약 key로 사용되는 column의 이름이 다른 경우 'left_on', 'right_on' 인수를 사용하여 key value를 맞춘다.

In [19]:
pd.merge(join_df, df_c, left_on='id', right_on='id')

  id a_name b_name  test_id
0  1      a     a1       51
1  2      b     b1       15
2  3      c     c1       15
3  4      d     d1       61
4  4      A     A1       61
5  5      e     e1       16
6  5      B     B1       16
7  7      D     D1       14
8  8      E     E1       15

## Merge with 'outer', 'inner', 'right', 'left'
ex) pd.merge(df_a, df_b, on='xxx', how= 'outer','inner,'right','left')

'how' 인자를 사용하여 (outer / inner / right / left) 중 JOIN 방법 선택

In [21]:
pd.merge(df_a, df_b, on='id', how='outer')

  id a_name_x b_name_x a_name_y b_name_y
0  1        a       a1      NaN      NaN
1  2        b       b1      NaN      NaN
2  3        c       c1      NaN      NaN
3  4        d       d1        A       A1
4  5        e       e1        B       B1
5  6      NaN      NaN        C       C1
6  7      NaN      NaN        D       D1
7  8      NaN      NaN        E       E1

In [22]:
pd.merge(df_a, df_b, on='id', how='inner')

  id a_name_x b_name_x a_name_y b_name_y
0  4        d       d1        A       A1
1  5        e       e1        B       B1

In [23]:
pd.merge(df_a, df_b, on='id', how='right')

  id a_name_x b_name_x a_name_y b_name_y
0  4        d       d1        A       A1
1  5        e       e1        B       B1
2  6      NaN      NaN        C       C1
3  7      NaN      NaN        D       D1
4  8      NaN      NaN        E       E1

In [24]:
pd.merge(df_a, df_b, on='id', how='left')

  id a_name_x b_name_x a_name_y b_name_y
0  1        a       a1      NaN      NaN
1  2        b       b1      NaN      NaN
2  3        c       c1      NaN      NaN
3  4        d       d1        A       A1
4  5        e       e1        B       B1

### extra.Merge based on index

In [26]:
pd.merge(df_a, df_b, right_index=True, left_index=True)

  id_x a_name_x b_name_x id_y a_name_y b_name_y
0    1        a       a1    4        A       A1
1    2        b       b1    5        B       B1
2    3        c       c1    6        C       C1
3    4        d       d1    7        D       D1
4    5        e       e1    8        E       E1